{
  "modulo": "01",
  "titulo": "Fundamentos da Programação",
  "descricao": "Revisão dos conceitos fundamentais de programação e Python",
  "questoes": [
    {
      "id": 1,
      "pergunta": "O que é uma variável em programação?",
      "resposta": "Uma variável é um espaço na memória do computador usado para armazenar dados que podem ser modificados durante a execução do programa. É como uma caixa com um nome onde guardamos informações.",
      "categoria": "Conceitos Básicos"
    },
    {
      "id": 2,
      "pergunta": "Quais são os tipos de dados básicos em Python?",
      "resposta": "Os tipos básicos são: int (números inteiros), float (números decimais), str (texto/strings), bool (verdadeiro/falso), list (listas), tuple (tuplas) e dict (dicionários).",
      "categoria": "Tipos de Dados"
    },
    {
      "id": 3,
      "pergunta": "O que é um algoritmo?",
      "resposta": "Um algoritmo é uma sequência finita de passos bem definidos para resolver um problema ou executar uma tarefa. É como uma receita que o computador segue para chegar a um resultado.",
      "categoria": "Lógica de Programação"
    },
    {
      "id": 4,
      "pergunta": "Para que serve a estrutura de controle 'if/else'?",
      "resposta": "A estrutura if/else permite que o programa tome decisões. O código dentro do 'if' executa se a condição for verdadeira, e o código do 'else' executa se for falsa. É como fazer escolhas baseadas em condições.",
      "categoria": "Estruturas de Controle"
    },
    {
      "id": 5,
      "pergunta": "Qual a diferença entre 'for' e 'while'?",
      "resposta": "O loop 'for' é usado quando sabemos quantas vezes queremos repetir algo (iterações definidas). O 'while' repete enquanto uma condição for verdadeira (iterações indefinidas).",
      "categoria": "Loops"
    },
    {
      "id": 6,
      "pergunta": "O que é a sintaxe de uma linguagem de programação?",
      "resposta": "Sintaxe são as regras que definem como escrever código corretamente em uma linguagem. É como a gramática de um idioma - se não seguirmos as regras, o computador não entenderá o código.",
      "categoria": "Python Básico"
    },
    {
      "id": 7,
      "pergunta": "Por que Python usa indentação (espaços)?",
      "resposta": "Python usa indentação para definir blocos de código, diferente de outras linguagens que usam chaves {}. A indentação torna o código mais legível e organizado visualmente.",
      "categoria": "Sintaxe Python"
    },
    {
      "id": 8,
      "pergunta": "O que é um fluxograma?",
      "resposta": "Um fluxograma é uma representação visual de um algoritmo usando símbolos e setas. Ajuda a planejar a lógica do programa antes de escrever o código, mostrando o fluxo de decisões e ações.",
      "categoria": "Lógica de Programação"
    },
    {
      "id": 9,
      "pergunta": "O que faz a função 'print()' em Python?",
      "resposta": "A função print() exibe informações na tela (console). É usada para mostrar resultados, mensagens e valores de variáveis durante a execução do programa.",
      "categoria": "Python Básico"
    },
    {
      "id": 10,
      "pergunta": "O que é um IDE e para que serve?",
      "resposta": "IDE (Integrated Development Environment) é um ambiente de desenvolvimento integrado como Thonny ou VS Code. Fornece ferramentas para escrever, testar e depurar código de forma mais eficiente.",
      "categoria": "Ambiente de Desenvolvimento"
    },
    {
      "id": 11,
      "pergunta": "Como declaramos uma variável em Python?",
      "resposta": "Em Python, basta escrever o nome da variável seguido de '=' e o valor. Exemplo: nome = 'João' ou idade = 15. Python identifica automaticamente o tipo de dado.",
      "categoria": "Variáveis"
    },
    {
      "id": 12,
      "pergunta": "O que são operadores em programação?",
      "resposta": "Operadores são símbolos que realizam operações sobre valores. Exemplos: + (soma), - (subtração), * (multiplicação), / (divisão), == (comparação), and/or (lógicos).",
      "categoria": "Conceitos Básicos"
    },
    {
      "id": 13,
      "pergunta": "O que significa 'comentar' o código?",
      "resposta": "Comentar é adicionar texto explicativo no código usando # (Python). Os comentários são ignorados pelo computador, mas ajudam humanos a entender o que o código faz.",
      "categoria": "Boas Práticas"
    },
    {
      "id": 14,
      "pergunta": "O que é input() em Python?",
      "resposta": "A função input() permite que o programa receba dados do usuário via teclado. O programa pausa e aguarda o usuário digitar algo, que é armazenado como string.",
      "categoria": "Python Básico"
    },
    {
      "id": 15,
      "pergunta": "Por que Python é uma boa linguagem para iniciantes?",
      "resposta": "Python tem sintaxe simples e legível, parecida com inglês. Possui comunidade grande, muitas bibliotecas, documentação excelente e é usado em diversas áreas (jogos, IA, web, ciência de dados).",
      "categoria": "História do Python"
    }
  ]
}
