{
  "modulo": "04",
  "titulo": "Inteligência Artificial e Automação",
  "descricao": "Revisão dos conceitos de IA, bots inteligentes e bibliotecas de Machine Learning",
  "questoes": [
    {
      "id": 1,
      "pergunta": "O que é Inteligência Artificial (IA)?",
      "resposta": "IA é a capacidade de máquinas realizarem tarefas que normalmente requerem inteligência humana, como aprender, raciocinar, perceber padrões e tomar decisões. Em jogos, permite criar NPCs (personagens não-jogáveis) que se comportam de forma inteligente.",
      "categoria": "Conceitos de IA"
    },
    {
      "id": 2,
      "pergunta": "O que é um bot em programação?",
      "resposta": "Um bot é um programa automatizado que executa tarefas repetitivas ou toma decisões sem intervenção humana. Em jogos, bots podem ser inimigos controlados por IA, assistentes virtuais ou jogadores automatizados.",
      "categoria": "Bots Básicos"
    },
    {
      "id": 3,
      "pergunta": "Como criar um bot básico usando lógica condicional?",
      "resposta": "Use estruturas if/else para criar regras de decisão. Exemplo: if distancia_jogador < 5: atacar() elif vida < 20: fugir() else: patrulhar(). O bot avalia condições e executa ações baseadas em regras predefinidas.",
      "categoria": "Lógica Condicional"
    },
    {
      "id": 4,
      "pergunta": "O que é um algoritmo de tomada de decisão?",
      "resposta": "É um conjunto de regras que permite ao programa escolher entre diferentes ações. Pode ser simples (if/else) ou complexo (árvores de decisão, máquinas de estado). Define como o bot reage a diferentes situações no jogo.",
      "categoria": "Algoritmos de Decisão"
    },
    {
      "id": 5,
      "pergunta": "O que é uma máquina de estados finitos (FSM)?",
      "resposta": "FSM é um modelo onde o bot tem estados (patrulhando, atacando, fugindo) e transições entre eles. Exemplo: estado 'patrulhando' → vê jogador → transição para 'atacando'. Muito usado em IA de jogos por ser simples e eficiente.",
      "categoria": "Máquinas de Estado"
    },
    {
      "id": 6,
      "pergunta": "O que é Machine Learning (Aprendizado de Máquina)?",
      "resposta": "É um subcampo da IA onde programas aprendem com dados em vez de serem explicitamente programados. O algoritmo identifica padrões nos dados e melhora seu desempenho com a experiência, sem precisar de novas regras manuais.",
      "categoria": "Machine Learning"
    },
    {
      "id": 7,
      "pergunta": "O que é TensorFlow?",
      "resposta": "TensorFlow é uma biblioteca de código aberto do Google para Machine Learning e Deep Learning. Permite criar e treinar redes neurais para reconhecimento de padrões, classificação, previsão e outras tarefas de IA. Instalação: pip install tensorflow.",
      "categoria": "TensorFlow"
    },
    {
      "id": 8,
      "pergunta": "O que é PyTorch?",
      "resposta": "PyTorch é uma biblioteca de Machine Learning desenvolvida pelo Facebook, alternativa ao TensorFlow. Conhecida por ser mais intuitiva e pythônica, popular em pesquisa e produção. Excelente para criar redes neurais. Instalação: pip install torch.",
      "categoria": "PyTorch"
    },
    {
      "id": 9,
      "pergunta": "O que é uma rede neural artificial?",
      "resposta": "É um modelo inspirado no cérebro humano, com camadas de 'neurônios' conectados. Recebe entrada, processa através das camadas com pesos ajustáveis, e produz saída. Aprende ajustando pesos durante treinamento para melhorar previsões.",
      "categoria": "Redes Neurais"
    },
    {
      "id": 10,
      "pergunta": "Como treinar um modelo de IA simples?",
      "resposta": "1) Prepare dados de treino (entrada → saída esperada), 2) Crie o modelo (rede neural), 3) Defina função de perda (erro), 4) Use otimizador, 5) Treine com model.fit() mostrando exemplos, 6) Teste com novos dados, 7) Ajuste e melhore.",
      "categoria": "Treinamento de IA"
    },
    {
      "id": 11,
      "pergunta": "O que é comportamento automatizado em jogos?",
      "resposta": "São ações que NPCs realizam sem intervenção do jogador: patrulhar rotas, perseguir inimigos, coletar itens, esquivar de obstáculos. Pode usar IA simples (if/else) ou complexa (ML) para parecer mais realista e imprevisível.",
      "categoria": "Comportamento Automatizado"
    },
    {
      "id": 12,
      "pergunta": "Como fazer um inimigo seguir o jogador?",
      "resposta": "Calcule a direção: dx = jogador.x - inimigo.x, dy = jogador.y - inimigo.y. Normalize o vetor, multiplique pela velocidade e mova o inimigo. Adicione verificações de distância para parar de seguir ou começar a atacar.",
      "categoria": "Pathfinding Básico"
    },
    {
      "id": 13,
      "pergunta": "O que é o algoritmo A* (A-star)?",
      "resposta": "A* é um algoritmo de pathfinding (busca de caminho) que encontra o caminho mais curto entre dois pontos, considerando obstáculos. Muito usado em jogos para NPCs navegarem pelo mapa de forma inteligente e eficiente.",
      "categoria": "Pathfinding Avançado"
    },
    {
      "id": 14,
      "pergunta": "Como testar e melhorar um bot de IA?",
      "resposta": "1) Teste em cenários variados, 2) Observe comportamentos estranhos ou bugs, 3) Ajuste parâmetros (velocidade, distância de detecção, cooldowns), 4) Adicione aleatoriedade para imprevisibilidade, 5) Balance dificuldade, 6) Colete feedback de jogadores.",
      "categoria": "Testes e Ajustes"
    },
    {
      "id": 15,
      "pergunta": "Qual a diferença entre IA baseada em regras e Machine Learning?",
      "resposta": "IA baseada em regras usa if/else explícito (previsível, fácil de entender, mas rígida). Machine Learning aprende com dados (flexível, descobre padrões, mas precisa de treino e dados). Para jogos simples, regras são suficientes; para complexos, ML pode surpreender.",
      "categoria": "Comparação de Abordagens"
    }
  ]
}
