{
  "modulo": 5,
  "titulo": "Segurança Digital e Autenticação",
  "questoes": [
    {
      "id": 1,
      "categoria": "Conceitos Básicos",
      "pergunta": "Qual é a diferença fundamental entre autenticação e autorização?",
      "resposta": "Autenticação é o processo de verificar QUEM você é (identificação do usuário), enquanto autorização é verificar O QUE você pode fazer (permissões e acessos). Exemplo: fazer login (autenticação) e depois poder editar um documento (autorização)."
    },
    {
      "id": 2,
      "categoria": "Importância da Segurança",
      "pergunta": "Por que a segurança é crucial em aplicações modernas, especialmente em jogos online?",
      "resposta": "A segurança protege dados pessoais dos usuários, previne fraudes e trapaças, garante a integridade das contas e transações, evita acesso não autorizado a recursos do jogo, e mantém a confiança dos jogadores. Sem segurança adequada, contas podem ser invadidas e dados roubados."
    },
    {
      "id": 3,
      "categoria": "OAuth 2.0 Fundamentos",
      "pergunta": "O que é o protocolo OAuth 2.0 e qual seu papel principal?",
      "resposta": "OAuth 2.0 é um protocolo de AUTORIZAÇÃO que permite que aplicações acessem recursos em nome do usuário sem compartilhar senha. É a base do OIDC e permite o famoso 'Login com Google/Facebook'. Separa a autenticação da autorização de forma segura."
    },
    {
      "id": 4,
      "categoria": "OIDC - O que é",
      "pergunta": "O que é OpenID Connect (OIDC) e como ele se relaciona com OAuth 2.0?",
      "resposta": "OIDC é uma camada de IDENTIDADE construída sobre OAuth 2.0. Enquanto OAuth 2.0 trata de autorização, OIDC adiciona autenticação padronizada. Ele fornece informações sobre a identidade do usuário através de tokens, permitindo login seguro e único (SSO - Single Sign-On)."
    },
    {
      "id": 5,
      "categoria": "OIDC em Jogos",
      "pergunta": "Como OIDC é usado para login seguro em jogos e aplicações online?",
      "resposta": "OIDC permite que jogadores façam login usando contas existentes (Google, Steam, Xbox Live) sem criar nova senha. O jogo recebe tokens que confirmam a identidade do jogador de forma segura, sem acessar a senha original. Isso melhora a experiência e reduz riscos de segurança."
    },
    {
      "id": 6,
      "categoria": "Tipos de Tokens",
      "pergunta": "Quais são os dois principais tipos de tokens no OIDC e suas funções?",
      "resposta": "1) ID Token: contém informações sobre a IDENTIDADE do usuário (nome, email, ID único). É um JWT que comprova quem fez login. 2) Access Token: usado para AUTORIZAR acesso a recursos protegidos (APIs, dados). Funciona como uma 'chave' temporária para acessar informações específicas."
    },
    {
      "id": 7,
      "categoria": "Fluxo de Autenticação",
      "pergunta": "Descreva o fluxo básico de autenticação OIDC em 4 passos principais.",
      "resposta": "1) Usuário clica em 'Login com [Provedor]' na aplicação. 2) É redirecionado para o provedor de identidade (Google, etc.) para fazer login. 3) Após login bem-sucedido, provedor envia código de autorização. 4) Aplicação troca o código por tokens (ID token e Access token) e confirma a identidade do usuário."
    },
    {
      "id": 8,
      "categoria": "JWT - JSON Web Token",
      "pergunta": "O que é um JWT (JSON Web Token) e qual sua estrutura básica?",
      "resposta": "JWT é um formato de token seguro usado no OIDC. Estrutura: Header.Payload.Signature (3 partes separadas por ponto). Header contém tipo e algoritmo, Payload contém dados (claims) do usuário, Signature garante que o token não foi alterado. É codificado em Base64 e pode ser verificado sem consultar o servidor."
    },
    {
      "id": 9,
      "categoria": "Scopes e Claims",
      "pergunta": "O que são 'scopes' e 'claims' no contexto de OIDC?",
      "resposta": "Scopes são PERMISSÕES solicitadas pela aplicação (ex: 'openid', 'profile', 'email'). Claims são as INFORMAÇÕES específicas retornadas no token (ex: 'sub' para ID do usuário, 'name', 'email'). Scopes determinam quais claims você receberá no token."
    },
    {
      "id": 10,
      "categoria": "Segurança de Tokens",
      "pergunta": "Por que tokens têm tempo de expiração e o que são refresh tokens?",
      "resposta": "Tokens expiram para limitar o dano se forem roubados - um token roubado só funciona por pouco tempo. Refresh Tokens são tokens especiais de longa duração que permitem obter novos Access Tokens sem fazer login novamente. São mais seguros porque só podem ser usados com o servidor de autorização."
    },
    {
      "id": 11,
      "categoria": "PKCE",
      "pergunta": "O que é PKCE (Proof Key for Code Exchange) e por que é importante para aplicações móveis/públicas?",
      "resposta": "PKCE é uma extensão de segurança do OAuth 2.0 que protege contra ataques de interceptação de código em aplicações públicas (mobile, desktop, SPAs). Funciona gerando um código secreto aleatório que deve ser apresentado na troca do código por tokens, garantindo que só quem iniciou o fluxo pode completá-lo."
    },
    {
      "id": 12,
      "categoria": "Endpoints OIDC",
      "pergunta": "Quais são os 3 principais endpoints de um provedor OIDC?",
      "resposta": "1) Authorization Endpoint: onde o usuário faz login e autoriza a aplicação. 2) Token Endpoint: onde a aplicação troca o código por tokens. 3) UserInfo Endpoint: onde a aplicação pode buscar informações adicionais do usuário usando o Access Token. Há também o Discovery Endpoint (.well-known) para configuração automática."
    },
    {
      "id": 13,
      "categoria": "Single Sign-On (SSO)",
      "pergunta": "Como OIDC habilita Single Sign-On (SSO) e quais suas vantagens?",
      "resposta": "SSO permite que um usuário faça login uma vez e acesse múltiplas aplicações sem login repetido. OIDC mantém uma sessão no provedor de identidade. Vantagens: melhor experiência do usuário, menos senhas para lembrar, gerenciamento centralizado de segurança, e facilita controle de acesso empresarial."
    },
    {
      "id": 14,
      "categoria": "Segurança - Boas Práticas",
      "pergunta": "Quais são 4 boas práticas essenciais ao implementar OIDC em uma aplicação?",
      "resposta": "1) Sempre usar HTTPS para proteger tokens em trânsito. 2) Validar tokens adequadamente (assinatura, expiração, issuer). 3) Nunca armazenar tokens em locais inseguros (ex: localStorage para dados sensíveis). 4) Usar PKCE para aplicações públicas e implementar logout adequado para limpar sessões."
    },
    {
      "id": 15,
      "categoria": "Implementação Prática",
      "pergunta": "Qual seria um exemplo prático simples de implementar login OIDC em uma aplicação Python?",
      "resposta": "Usar biblioteca como 'authlib' ou 'python-jose': 1) Configurar client_id e client_secret do provedor. 2) Criar rota de login que redireciona para authorization_url. 3) Criar rota de callback que recebe o código e troca por tokens. 4) Validar o ID token e extrair informações do usuário. 5) Criar sessão na aplicação com dados do usuário."
    }
  ]
}
